import { BlogCard } from "@/components";
import PublicLayout from "../public-layout";
interface Blog {
  id: number;
  image: string;
  title: string;
  text: string;
  date: string;
  author: string;
  avatar: string;
}
const blogData: Blog[] = [
  {
    id: 1,
    image: "/images/blogs/1.jpg",
    title: "لورم ایپسوم متن ساختگی با تولید",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت.",
    date: "Mar 14, 2025",
    author: "سارا رضایی",
    avatar: "/images/1.jpg",
  },
  {
    id: 2,
    image: "/images/blogs/2.jpg",
    title: "لورم ایپسوم متن ساختگی با تولیدe",
    text: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت",
    date: "Mar 12, 2025",
    author: "محمد صادقی",
    avatar: "/images/1.jpg",
  },
  {
    id: 3,
    image: "/images/blogs/6.png",
    title: "شروع بازی سازی",
    text: "حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    date: "Mar 12, 2025",
    author: "آرش صفایی",
    avatar: "/images/1.jpg",
  },
  {
    id: 4,
    image: "/images/blogs/3.png",
    title: "چگونه در نظر گرفته شده‌است",
    text: " کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ",
    date: "Mar 12, 2025",
    author: "مریم حسینی",
    avatar: "/images/1.jpg",
  },
  {
    id: 5,
    image: "/images/blogs/8.png",
    title: "لورم ایپسوم یا طرح‌نما ",
    text: " ظاهر متن باشد. معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه ",
    date: "Mar 12, 2025",
    author: "سارا احمدی",
    avatar: "/images/1.jpg",
  },
  {
    id: 6,
    image: "/images/blogs/7.png",
    title: "عنصری از ترکیب بندی برای پر کردن صفحه",
    text: "در نظر گرفته شده‌است. از آنجایی که طراحان عموما نویسنده متن نیستند و وظیفه رعایت حق تکثیر متون را ندارند و در همان حال کار آنها به نوعی وابسته به متن می‌باشد آنها با استفاده از محتویات ساختگی، صفحه گرافیکی خود را صفحه‌آرایی می‌کنند تا مرحله طراحی",
    date: "Mar 12, 2025",
    author: "سپیده محمدزمانی",
    avatar: "/images/1.jpg",
  },
  // You can add more blog objects here
];
export default function Blogs() {
  return (
    <PublicLayout>
      <div className="p-4 flex justify-center ">
        <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-4 lg:grid-clos-5 gap-5 ">
          {blogData.map((blog) => (
            <BlogCard
              key={blog.id}
              image={blog.image}
              title={blog.title}
              text={blog.text}
              date={blog.date}
              author={blog.author}
              avatar={blog.avatar}
            />
          ))}
        </div>
      </div>
    </PublicLayout>
  );
}
